#----------------------------------------------------------------------------------------------------#
#                                                                                                    #
#----------------------------------------------------------------------------------------------------#


function evf_Ω(𝛺  ::Rad_per_μs_t
               ;
               𝛥   ::Rad_per_μs_t,
               ϕ  ::Vector{ℂ},
               R  ::Hermitian{ℂ,Matrix{ℂ}},
               ψ  ::Vector{ℂ},
               ε  ::ℝ,
               hw ::HW_Descr              ) ::ℝ

	(; 𝛺ₘₐₓ,𝛺ᵣₑₛ, 𝛥ₘₐₓ,𝛥ᵣₑₛ, 𝑡ᵒᶠᶠₘₐₓ,𝑡ᵒⁿ_𝑡ᵒᶠᶠₘᵢₙ, 𝑡ᵣₑₛ,𝑡ₘₐₓ) = get_hw_data(hw)
	(;𝛥𝑡ₘᵢₙ) = hw

	evf(ϕ,R,ψ ; 𝛺, 𝛥,
	 	Ω_𝑡ᵒⁿ=𝛥𝑡ₘᵢₙ, Ω_𝑡ᵒᶠᶠ=𝑡ᵒᶠᶠₘₐₓ,
	 	Δ_𝑡ᵒⁿ=𝛥𝑡ₘᵢₙ, Δ_𝑡ᵒᶠᶠ=𝑡ᵒᶠᶠₘₐₓ-get_hw_𝑡ᵒᶠᶠ⁻ᵈⁱᶠᶠ𝛥𝛺(hw;𝛺=𝛺ₘₐₓ, 𝛥),
	 	𝑇=𝑡ₘₐₓ,
        ε,
	 	hw)
end

function evf_Δ(𝛥  ::Rad_per_μs_t
               ;
               𝛺  ::Rad_per_μs_t,
               ϕ  ::Vector{ℂ},
               R  ::Hermitian{ℂ,Matrix{ℂ}},
               ψ  ::Vector{ℂ},
               ε  ::ℝ,
               hw ::HW_Descr              ) ::ℝ
    (; 𝛺ₘₐₓ,𝛺ᵣₑₛ, 𝛥ₘₐₓ,𝛥ᵣₑₛ, 𝑡ᵒᶠᶠₘₐₓ,𝑡ᵒⁿ_𝑡ᵒᶠᶠₘᵢₙ, 𝑡ᵣₑₛ,𝑡ₘₐₓ) = get_hw_data(hw)
	(;𝛥𝑡ₘᵢₙ) = hw

    evf(ϕ,R,ψ ; 𝛺, 𝛥,
	 	Ω_𝑡ᵒⁿ=𝛥𝑡ₘᵢₙ, Ω_𝑡ᵒᶠᶠ=𝑡ᵒᶠᶠₘₐₓ+get_hw_𝑡ᵒᶠᶠ⁻ᵈⁱᶠᶠ𝛥𝛺(hw;𝛺, 𝛥=𝛥ₘₐₓ),
	 	Δ_𝑡ᵒⁿ=𝛥𝑡ₘᵢₙ, Δ_𝑡ᵒᶠᶠ=𝑡ᵒᶠᶠₘₐₓ,
	 	𝑇=𝑡ₘₐₓ,
        ε,
	 	hw)
end

